s={ "Одеська":"площа - 33 310км²","Дніпропетровська" :"площа- 31 914км²","Чернігівська":"площа - 31 865км²","Харківська":"площа - 31 415км²","Житомирська":"площа -29 832км²"}
print ("ведіть 1 щоб додати до словника запису,2 для пошуку у словнику за назвою області,3 для видалення з словника запису за ключем,введіть 4 для завершення")
n=0
while not n==1:
    a=int(input("Введіть цифру "))
    if a==1:
        q=(input("Введіть область "))
        w=(input("Введіть площу "))
        s[q]="площа - "+w+"км²"
    elif a==2:
        q=(input("Введіть область "))
        if q in s:
            print(s[q])
        else:
            print("нема в словнику такої області")
    elif a==3:
        q=(input("Введіть область яку хочете видалити "))
        if q in s:
            s.pop(q)
        else:
            print("нема в словнику такої області")
    elif a==4:
        break
    else:
        print("не приймає таке значення ")
print(s)

