import tkinter as tk 
def action1():     
    a=radokvodu.get()
    s=list(a)
    if len(a)==4 and s[0] in ("1","2","3","4","5","6","7","8","9","A","B","C"): 
        button.config(text='Введіть нову команду в синій рядок і натисніть кнопку ще раз')
        
        def ff(z=list):
            z='Код операції '+z[0]+', операнд '+z[1]+z[2]+z[3]+'.'+'\n'
            return(z)
        y=ff(s)
        if s[0]=="1":
            clova.config(text=y+'Ця команда завантажує в регістр R двійкового коду числа із комірки пам’яті з адресом XY.'+'\n'+'Команда '+a+ ' розміщує в регістр '+ s[1]+ ' вміст комірки пам’яті з адресом '+s[2]+s[3]+".")
        elif s[0]=="2":
            clova.config(text=y+'Ця команда завантажує в регістр R двійкового коду числа XY.'+'\n'+'Команда '+a+ ' розміщує в регістр '+ s[1]+ ' вміст комірки пам’яті з адресом '+s[2]+s[3]+".")
        elif s[0]=="3":
            clova.config(text=y+'Ця команда зберегає двійковий код числа, що зберігається в регістрі R, в комірці пам’яті з адресом XY.'+'\n'+'Команда '+a+' розміщує вміст регістра '+s[1]+' в комірку пам’яті з адресом ' +s[2]+s[3]+".")
        elif s[0]=="4" and (s[1])=="0" :
            clova.config(text=y+'Ця команда переміщує двійковий код числа з регістра R в регістр S.'+'\n' +'Команда '+a+' копіює вміст регістру '+s[2] +' в регістр '+s[3]+"." )
        elif s[0]=="5":
            clova.config(text=y+'Ця команда сумує двійкові коди чисел, що зберігаються в регістрах S і T, із збереженням суми в регістрі R.'+'\n' +'Команда '+a+' сумує двійкові коди чисел, що зберігаються в регістрах ' +s[2] +' і '+s[3]+', а суму розміщує в регістр ' +s[1]+".")
        elif s[0]=="6":
            clova.config(text=y+'Ця команда сумує двійкові коди чисел в форматі з плаваючою комою, що зберігаються в регістрах S і Т,'+'\n' +' з розміщенням результату в формі з плаваючою комою в регістрі R.'+'\n' +'Команда '+a+' сумує числа в форматі з плаваючою комою, що зберігаються в регістрах '+s[2] +' і '+s[3]+','+'\n' +' і розміщує результат в формі з плаваючою комою в регістр ' +s[1]+".") 
        elif s[0]=="7":
            clova.config(text=y+'Ця команда виконує порозрядну операцію OR над двійковими кодами чисел, що зберігаються в регістрах S і T, '+'\n' +'з розміщенням результату в регістрі R.' +'\n' +'Команда '+a+' розміщує в регістр ' +s[1]+ ' результат операції  OR над вмістом регістрів ' +s[2] +' і '+s[3]+".")
        elif s[0]=="8":
            clova.config(text=y+'Ця команда  виконує порозрядну операцію AND над двійковими кодами чисел, що зберігаються в регістрах S і T,'+'\n' +' з розміщенням результату в регістрі R.' +'\n' +'Команда '+a+'розміщує в регістр ' + s[1]+' результат операції  AND над вмістом регістрів ' +s[2] +' і '+s[3]+".")
        elif s[0]=="9":
            clova.config(text=y+'Ця команда  виконує порозрядну операцію XOR над двійковими кодами чисел, що зберігаються в регістрах S і T,'+'\n' +' з розміщенням результату в регістрі R.'  +'\n' +'Команда '+a+'розміщує в регістр ' + s[1]+' результат операції  XOR над вмістом регістрів ' +s[2] +' і '+s[3]+".")
        elif s[0]=="A" and (s[2])=="0" :
            clova.config(text=y+'Під час цієї команди виконується операція циклічного порозрядного здвигу вправо на Х позицій над двійковим кодом числа,'+'\n' +' що зберігається в регістрі R. При кожному одиночному здвигу біт з молодшого розряду переміщується в старший розряд.'   +'\n' +'Команда '+a+' виконує циклічний порозрядний здвиг вправо на ' +s[3] +' біта у вмісті регістру ' +s[1]+".")
        elif s[0]=="B":
            clova.config(text=y+'Під час цієї команди виконується перехід до команди, що розміщена в комірці пам’яті по адресу XY,'+'\n' +' якщо двійковий код числа в регістрі R співпадає з двійковим кодом числа в регістрі 0.' +'\n'+'Команда '+a+ ' спочатку порівнює вміст регістра ' +s[1]+ ' змістом регістра 0.'+'\n' +' Якщо вони рівні, послідовність виконання команд змінюється так, '+'\n' +' що наступною буде виконана команда, розміщена в пам’яті за адресом '  +s[2]+s[3]+'.'+'\n' +' В іншому випадку виконання програми продовжується в звичайній послідовності.' ) 
        elif s[0]=="C" and (s[1])=="0" and (s[2])=="0" and (s[3])=="0":
            clova.config(text=y+'Ця команда '+a+ ' припиняє виконання програми.')
        else:
            clova.config(text='не може розшифрувати цю команду,попробуйте ще раз' )
    else:
        clova.config(text='не може розшифрувати цю команду,попробуйте ще раз' )
window = tk.Tk()
clova = tk.Label(text='Введіть машинну команду в синій рядок і натисність пуск', foreground='black',background='yellow',width=100,height=10) 
radokvodu = tk.Entry(foreground="white", background="blue", width=30)
button = tk.Button(text="ПУСК",width=50,height=2,background="brown",foreground="yellow", command=action1) 
clova.pack() 
radokvodu.pack() 
button.pack()
window.mainloop()